ERP.belugaerp/src/Documents/битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС/битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеНаЯзыкеПроизводителя</name>
    <comment>FullNameManufacturerLanguage</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <comment>VidAP</comment>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>FullName</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработкиПива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрепостьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрепостьМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РынокПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НациональныйСтандарт</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияОСоответствии</name>
    <type>
      <types>CatalogRef.СертификатыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатСоответствия</name>
    <type>
      <types>CatalogRef.СертификатыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтличительныеХарактеристики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтличительныеХарактеристикиХранения</name>
    <type>
      <types>CatalogRef.битУсловияОбращенияСАлкогольнойПродукциейЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервойПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТоварногоЗнака</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосударственнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГосударственнойРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПравообладателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПеревозки</name>
    <type>
      <types>CatalogRef.битУсловияОбращенияСАлкогольнойПродукциейЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияРеализации</name>
    <type>
      <types>CatalogRef.битУсловияОбращенияСАлкогольнойПродукциейЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияУтилизации</name>
    <type>
      <types>CatalogRef.битУсловияОбращенияСАлкогольнойПродукциейЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Емкости</name>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТары</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТары</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка</name>
      <type>
        <types>CatalogRef.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИСПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеТары</name>
      <comment>CapacityDescrVal</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сырье</name>
      <comment>CompulsoryRawMaterials</comment>
      <type>
        <types>CatalogRef.битСырьеЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Компонент</name>
      <comment>CompulsoryRawMaterialsDescr</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДругаяАлкогольнаяПродукция</name>
      <comment>OtherAP</comment>
      <type>
        <types>CatalogRef.ВидыАлкогольнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ИноеСырье</name>
      <comment>OtherRawMaterials</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеРегламенты</name>
    <attributes>
      <name>Регламент</name>
      <type>
        <types>CatalogRef.битТехническиеРегламенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическиеИнструкции</name>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИСПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/битТехническиеРегламенты/битТехническиеРегламенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битТехническиеРегламенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Documents/битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияЕГАИСПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	РаботаСФайлами.УстановитьПометкуУдаленияПрисоединенныхФайловДокументов(
		ЭтотОбъект,
		Отказ,
		РежимЗаписи,
		РежимПроведения);
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);

КонецПроцедуры

&После("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
	ИдентификаторЕГАИС = "";
	
	// Присоединенные файлы не копируются вместе с документом.
	// Очистим файлы, чтобы в документе не было ссылок на присоединенные файлы другого владельца. 
	Для Каждого СтрокаТЧ Из Емкости Цикл
		СтрокаТЧ.Этикетка = Неопределено;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из ТехнологическиеИнструкции Цикл
		СтрокаТЧ.Файл = Неопределено;
	КонецЦикла;
	
	// Так как у этих реквизитов в диалоговой форме отключена видимость,
	// будем их очищать при копировании, чтобы избежать скрытых от пользователя данных.
	// Если будем оформлять уведомления на пиво, то этот код надо убрать,
	// а у соответствующих реквизитов формы документа включить видимость. 
	ТипПива = "";
	СпособОбработкиПива = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	ДатаПервойПоставки = 
		Документы.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.ДатаПервойПоставки(ТекущаяДатаСеанса());
	
	Если Не ЗначениеЗаполнено(ТипОрганизации) Тогда
		СписокВыбора = Новый СписокЗначений;
		бг_ИнтеграцияЕГАИС.ЗаполнитьСписокВыбораТипаОрганизацииПроизводителя(СписокВыбора);
		ТипОрганизации = СписокВыбора[0].Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		СтранаПроисхождения = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	КонецЕсли;
	
	ЗаполнитьТехническиеРегламенты();
	
КонецПроцедуры

Процедура ЗаполнитьТехническиеРегламенты()
	
	ТехническиеРегламенты.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	битТехническиеРегламенты.Ссылка КАК Регламент,
	|	битТехническиеРегламенты.Номер КАК Номер,
	|	битТехническиеРегламенты.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.битТехническиеРегламенты КАК битТехническиеРегламенты
	|ГДЕ
	|	НЕ битТехническиеРегламенты.ПометкаУдаления";
	
	ТехническиеРегламенты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
